
// Получает XML-текст макета компоновки данных
//
// Параметры:
//  МакетКомпоновкиДанных - МакетКомпоновкиДанных - Выводимый макет.
//
// Возвращаемое значение:
//  Строка - Текст макета компоновки данных в виде XML.
//
Функция ТекстМакетаКомпоновкиДанных(МакетКомпоновкиДанных)
  
  ЗаписьXML = Новый ЗаписьXML;
  ЗаписьXML.УстановитьСтроку();
  СериализаторXDTO.ЗаписатьXML(
	  ЗаписьXML, 
	  МакетКомпоновкиДанных, 
	  "dataComposition", 
	  "http://v8.1c.ru/8.1/data-composition-system/composition-template");
	  
  Возврат ЗаписьXML.Закрыть();
  
КонецФункции

// #СДЕЛАТЬ
//
// Преобразует поле из собственного формата СКД в формат, приемлемый для запроса.
//	Работает для таких выражений как НачалоМесяца(), Даты начала и конца, Части дат.
//
// Параметры:
//  ИмяПоля       -      - 
//  Выражение     -      - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьВыражениеПоляИзФорматаСКД(Знач Выражение, Отказ = Ложь)

    // В полях группировки могут встречаться поля СКД типа СрокОплаты.ЧастиДат.Месяц
    // Преобразуем такие поля в поля выражений запроса:
    #Область ЧастиДат
    ДопустимыеТипыПериодовСтрокой = "МИНУТА, ЧАС, ДЕНЬ, НЕДЕЛЯ, МЕСЯЦ, КВАРТАЛ, ГОД, ДЕКАДА, ПОЛУГОДИЕ";    // см. функцию языка запроса НАЧАЛОПЕРИОДА()
    ШаблоныВыражений = Новый Соответствие;
    ШаблоныВыражений.Вставить("НачалоМинуты",        СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "МИНУТА"));
    ШаблоныВыражений.Вставить("НачалоЧаса",            СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "ЧАС"));
    ШаблоныВыражений.Вставить("НачалоДня",            СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "ДЕНЬ"));
    ШаблоныВыражений.Вставить("НачалоНедели",        СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "НЕДЕЛЯ"));
    ШаблоныВыражений.Вставить("НачалоМесяца",        СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "МЕСЯЦ"));
    ШаблоныВыражений.Вставить("НачалоКвартала",        СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "КВАРТАЛ"));
    ШаблоныВыражений.Вставить("НачалоГода",            СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "ГОД"));
    ШаблоныВыражений.Вставить("НачалоДекаты",        СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "ДЕКАДА"));
    ШаблоныВыражений.Вставить("НачалоПолугодия",    СтрШаблон("НАЧАЛОПЕРИОДА(%1, %2)", "%1", "ПОЛУГОДИЕ"));
    ДопустимыеТипыПериодов = Новый Массив;
    Для каждого Элемент Из ШаблоныВыражений Цикл
        ДопустимыеТипыПериодов.Добавить(Элемент.Ключ);
    КонецЦикла; 
    Для каждого ТипПериода Из ДопустимыеТипыПериодов Цикл
        ВыражениеПоля = ШаблоныВыражений.Получить(ТипПериода);
        ШаблоныВыражений.Вставить(СтрЗаменить(ТипПериода, "Начало", "Конец"), СтрЗаменить(ВыражениеПоля, "НАЧАЛОПЕРИОДА", "КОНЕЦПЕРИОДА"));                
    КонецЦикла;
    ДопустимыеТипыПериодов.Очистить();
    
    Маркер = ".ДатыНачала.";
    Если СтрНайти(Выражение, Маркер) > 0 Тогда
        ТипПериода = Прав(Выражение, СтрДлина(Выражение) - СтрНайти(Выражение, Маркер) + 1 - СтрДлина(Маркер));    // Хвост справа
        ШаблонВыражения = ШаблоныВыражений.Получить(ТипПериода);
        Если ШаблонВыражения = Неопределено Тогда
            Сообщить("Не допускается использование границы периода " + ТипПериода + " в группировке");
            //Продолжить;    // Нет такой части даты
            Отказ = Истина;
        КонецЕсли; 
        ИмяПоляДаты = Лев(Выражение, СтрНайти(Выражение, Маркер) - 1);
        Выражение = СтрШаблон(ШаблонВыражения, ИмяПоляДаты);
        ПолеМодифицировано    = Истина;
    КонецЕсли; 
    
    Маркер = ".ДатыКонца.";
    Если СтрНайти(Выражение, Маркер) > 0 Тогда
        ТипПериода = Прав(Выражение, СтрДлина(Выражение) - СтрНайти(Выражение, Маркер) + 1 - СтрДлина(Маркер));    // Хвост справа
        ШаблонВыражения = ШаблоныВыражений.Получить(ТипПериода);
        Если ШаблонВыражения = Неопределено Тогда
            Сообщить("Не допускается использование границы периода " + ТипПериода + " в группировке");
            //Продолжить;    // Нет такой части даты
            Отказ = Истина;
        КонецЕсли; 
        ИмяПоляДаты = Лев(Выражение, СтрНайти(Выражение, Маркер) - 1);
        Выражение = СтрШаблон(ШаблонВыражения, ИмяПоляДаты);
        ПолеМодифицировано    = Истина;
    КонецЕсли; 
    
    Маркер = ".ЧастиДат.";
    ДопустимыеЧастиДат = "МИНУТА, ЧАС, ДЕНЬ, НЕДЕЛЯ, МЕСЯЦ, КВАРТАЛ, ГОД, ДЕНЬНЕДЕЛИ, ДЕНЬГОДА";    // см. функции языка запросов, напр. МЕСЯЦ()
    Если СтрНайти(Выражение, Маркер) > 0 Тогда
        ТипПериода = Прав(Выражение, СтрДлина(Выражение) - СтрНайти(Выражение, Маркер) + 1 - СтрДлина(Маркер));    // Хвост справа
        Если СтрНайти(врег(ДопустимыеЧастиДат), врег(ТипПериода)) = 0 Тогда
            Сообщить("Не допускается использование части даты " + ТипПериода + " в группировке");
            //Продолжить;    // Нет такой части даты
            Отказ = Истина;
        КонецЕсли; 
        ИмяПоляДаты = Лев(Выражение, СтрНайти(Выражение, Маркер) - 1);
        Выражение = СтрШаблон("%1(%2)", ВРЕГ(ТипПериода), ИмяПоляДаты);
        ПолеМодифицировано    = Истина;
    КонецЕсли; 
    #КонецОбласти    // ЧастиДат 
    
    Возврат Выражение;

КонецФункции // ПреобразоватьВыражениеПоляИзФорматаСКД()