// Получает таблицу значений по набору данных схемы компоновки или макета компоновки данных
//
// Параметры:
//  НаборДанных				 - Строка, НаборДанныхОбъектСхемыКомпоновкиДанных, НаборДанныхОбъектМакетаКомпоновкиДанных	 - Набор - источник колонок таблицы.
//		Если указана Строка, производится поиск набора данных в КоллекцияНаборовДанных по имени объекта
//  КоллекцияНаборовДанных	 - НаборыДанныхСхемыКомпоновкиДанных, НаборыДанныхМакетаКомпоновкиДанных, Массив	 - Коллекция наборов данных, доступная к перебору циклом.
//		Указывается, если производится поиск набора.
// Вариант вызова:
//		НовыйТаблицаЗначенийПоНаборуДанных(Строка, НаборыДанныхСхемыКомпоновкиДанных)	 - Поиск набора данных по имени объекта.
//		НовыйТаблицаЗначенийПоНаборуДанных(НаборДанныхОбъектСхемыКомпоновкиДанных)		 - Формирование таблицы по указанному набору.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица, сформированная по набору. Если найбор не найден, будет возвращено Неопределено.
//
Функция НовыйТаблицаЗначенийПоНаборуДанных(Знач НаборДанных, КоллекцияНаборовДанных = Неопределено)
	
	//Если Ложь Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных КонецЕсли;
	//Если Ложь Тогда КоллекцияНаборовДанных = СхемаКомпоновкиДанных.НаборыДанных КонецЕсли;

	Если ТипЗнч(НаборДанных) <> Тип("Строка")
		И ТипЗнч(НаборДанных) <> Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") 
		И ТипЗнч(НаборДанных) <> Тип("НаборДанныхОбъектМакетаКомпоновкиДанных") Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если ТипЗнч(НаборДанных) = Тип("Строка") Тогда
		// Поиск по имени объекта
	
		Для каждого ТекущийНаборДанных Из КоллекцияНаборовДанных Цикл
			Если ТипЗнч(ТекущийНаборДанных) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных")
				Или ТипЗнч(ТекущийНаборДанных) = Тип("НаборДанныхОбъектМакетаКомпоновкиДанных")
				И ТекущийНаборДанных.ИмяОбъекта = НаборДанных Тогда
				
				НаборДанных = ТекущийНаборДанных;					
							
			    Прервать;
				
			ИначеЕсли ТипЗнч(ТекущийНаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных")
				Или ТипЗнч(ТекущийНаборДанных) = Тип("НаборДанныхОбъединениеМакетаКомпоновкиДанных") Тогда
				
				ТаблицаПоНабору = НовыйТаблицаЗначенийПоНаборуДанных(НаборДанных, ТекущийНаборДанных.Элементы);	// Рекурсивный вызов для дочернего набора
				Если ТипЗнч(ТаблицаПоНабору) = Тип("ТаблицаЗначений") Тогда
					Возврат ТаблицаПоНабору;
				КонецЕсли; 
				
			КонецЕсли; 	
		КонецЦикла; 
	
	КонецЕсли; 
	
	ТаблицаПоНабору = Неопределено;
	
	Если ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") 
		Или ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъектМакетаКомпоновкиДанных") Тогда
		
		ТаблицаПоНабору = Новый ТаблицаЗначений;
		Для каждого ПолеНабора Из НаборДанных.Поля Цикл
			
			Если ТипЗнч(ПолеНабора) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных")
				или  ТипЗнч(ПолеНабора) = Тип("ПолеНабораДанныхМакетаКомпоновкиДанных") Тогда
				
				ТаблицаПоНабору.Колонки.Добавить(ПолеНабора.Поле, ПолеНабора.ТипЗначения, ПолеНабора.Заголовок);	
				
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли;  
	
	Возврат ТаблицаПоНабору;

КонецФункции // НовыйТаблицаЗначенийПоНаборуДанных()

// Получает XML-текст макета компоновки данных
//
// Параметры:
//  МакетКомпоновкиДанных - МакетКомпоновкиДанных - Выводимый макет.
//
// Возвращаемое значение:
//  Строка - Текст макета компоновки данных в виде XML.
//
Функция ТекстМакетаКомпоновкиДанных(МакетКомпоновкиДанных)
  
  ЗаписьXML = Новый ЗаписьXML;
  ЗаписьXML.УстановитьСтроку();
  СериализаторXDTO.ЗаписатьXML(
	  ЗаписьXML, 
	  МакетКомпоновкиДанных, 
	  "dataComposition", 
	  "http://v8.1c.ru/8.1/data-composition-system/composition-template");
	  
  Возврат ЗаписьXML.Закрыть();
  
КонецФункции