
// Рассчитывает факториал
//
// Параметры:
//  Основание	 - Число	 - Основание для расчета факториала
//  Факториалы	 - Массив	 - Расчитанные факториалы для повторного использования.
// 
// Возвращаемое значение:
//  Число - Рассчитаный факториал
//
Функция Факториал(Основание, Факториалы = Неопределено)

	Если Факториалы = Неопределено Тогда
		Факториалы = Новый Массив(2);
		Факториалы[0] = 1;
		Факториалы[1] = 1;
	КонецЕсли; 
	
	Если Факториалы.ВГраница() < Основание Тогда
		Факториалы.Вставить(Основание, Основание * Факториал(Основание - 1, Факториалы));
	КонецЕсли;
	
	Возврат Факториалы[Основание];

КонецФункции // Факториал()
