// Формирует текст схемы компоновки данных в формате XML
//
// Параметры:
//	Схема - СхемаКомпоновкиДанных
//
// Возвращаемое значение:
//	Строка - Схема компоновки в формате xml
//
Функция ТекстСхемыКомпоновкиДанныхXML(Схема)

	ЗаписьXML = Новый ЗаписьXML;
	ЛокальноеИмя = "dataComposition";
	URIПространстваИмен = "http://v8.1c.ru/8.1/data-composition-system/composition-template";
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Схема, ЛокальноеИмя, URIПространстваИмен);

	ТекстXML = ЗаписьXML.Закрыть();

	Возврат ТекстXML;

КонецФункции // ТекстСхемыКомпоновкиДанныхXML()

// Формирует текст настроек компоновки данных в формате XML
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных
//
// Возвращаемое значение:
//	Строка - Настройки компоновки в формате xml
//
Функция ТекстНастроекКомпоновкиДанныхXML(Настройки)

	ЗаписьXML = Новый ЗаписьXML;
	ЛокальноеИмя = "settingsComposition";
	URIПространстваИмен = "http://v8.1c.ru/8.1/data-composition-system/settings";
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки, ЛокальноеИмя, URIПространстваИмен);

	ТекстXML = ЗаписьXML.Закрыть();

	Возврат ТекстXML;

КонецФункции // ТекстНастроекКомпоновкиДанныхXML()

