// Объединяет схемы запроса
//
// Параметры:
//  ИсходнаяСхема            - СхемаЗапроса  - Обобщающая схема
//  ПрисоединяемаяСхема      - СхемаЗапроса  - схема, которая будет добавлена к исходной
//
Процедура ПрисоединитьСхемуЗапроса(ИсходнаяСхема, ПрисоединяемаяСхема) Экспорт

        Если Ложь Тогда ИсходнаяСхема		= Новый СхемаЗапроса КонецЕсли;
        Если Ложь Тогда ПрисоединяемаяСхема	= Новый СхемаЗапроса КонецЕсли;

        Для каждого ПрисоединяемыйЗапрос Из ПрисоединяемаяСхема.ПакетЗапросов Цикл
                Если ИсходнаяСхема.ПакетЗапросов.Количество() = 1
                        И ТипЗнч(ИсходнаяСхема.ПакетЗапросов[0]) = Тип("ЗапросВыбораСхемыЗапроса")
                        И НЕ ИсходнаяСхема.ПакетЗапросов[0].Колонки.Количество() Тогда     // Первый запрос пакета не задан
                        ЗапросПакета = ИсходнаяСхема.ПакетЗапросов[0];
                Иначе
                        ЗапросПакета = ИсходнаяСхема.ПакетЗапросов.Добавить(ТипЗнч(ПрисоединяемыйЗапрос));
                КонецЕсли;
                Если ТипЗнч(ПрисоединяемыйЗапрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
                        ЗапросПакета.УстановитьТекстЗапроса(ПрисоединяемыйЗапрос.ПолучитьТекстЗапроса());
                ИначеЕсли ТипЗнч(ПрисоединяемыйЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
                        ЗапросПакета.ИмяТаблицы        = ПрисоединяемыйЗапрос.ИмяТаблицы;
                КонецЕсли;
        КонецЦикла;

КонецПроцедуры
