// https://github.com/artbear/1testrunner

// BSLLS-off
// cSpell:disable

#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;		// Тестируемый модуль
Перем ИмяМодуля;	// Имя тестируемого модуля

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ШаблонТестирования");
	
	Возврат ВсеТесты;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
	//Модуль = ЗагрузитьСценарий(
	//	".\tests\testtemplate.os" 
	//);
	//ИмяМодуля = "testtemplate";

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	//ВременныеФайлы.Удалить();

КонецПроцедуры

#Область ИмяМетода

Процедура ШаблонТестирования() Экспорт

	//ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
	//ВременныйФайл = ВременныеФайлы.СоздатьФайл("tmp");
	
	//ИмяМетода = "ИмяМетода";
	//Параметры = Новый Массив;
	//Ожидаем
	//	.Что(Модуль, "[Описание ожидания]")
	//	.Метод(ИмяМетода, Параметры).ВыбрасываетИсключение();

	//Результат = Модуль.ПолучитьСписокТестов();
	//Ожидаем.Что(Результат).Заполнено();

КонецПроцедуры

#КонецОбласти // ИмяМетода

ПередЗапускомТеста();
