// BSLLS-off
// cSpell:disable

#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;		// Тестируемый модуль
Перем ИмяМодуля;	// Имя тестируемого модуля

Процедура Инициализация()
	
	Модуль = ЗагрузитьСценарий(
		".\ИмяМодуля.bsl" 
	);
	ИмяМодуля = "";

КонецПроцедуры

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ИмяМетода_ИмяТеста");
	
	Возврат ВсеТесты;

КонецФункции

#Область ИмяМетода

Процедура ИмяМетода_ИмяТеста() Экспорт

	//Результат = Модуль.ИмяМетода();
	//Ожидаем.Что(Результат).Равно();
	
КонецПроцедуры

#КонецОбласти // ИмяМетода

Инициализация();
