#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	Контекст = Новый Структура;
	Модуль = ЗагрузитьСценарий(
		"..\Общие\ОбщиеМодули\Математика.bsl", 
		Контекст
	);

	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ОкрВверх_ПростоеОкругление");
	ВсеТесты.Добавить("ОкрВверх_ОтрицательноеОкругление");
	ВсеТесты.Добавить("ОкрВверх_ПоложительнаяРазрядность");
	ВсеТесты.Добавить("ОкрВверх_ОтрицательнаяРазрядность");
	
	Возврат ВсеТесты;

КонецФункции

#Область ОкрВверх

Процедура ОкрВверх_ПростоеОкругление() Экспорт

	Результат = Модуль.ОкрВверх(1.5);
	Ожидаем.Что(Результат).Равно(2);

КонецПроцедуры

Процедура ОкрВверх_ОтрицательноеОкругление() Экспорт

	Результат = Модуль.ОкрВверх(-1.5);
	Ожидаем.Что(Результат).Равно(-2);

КонецПроцедуры

Процедура ОкрВверх_ПоложительнаяРазрядность() Экспорт

	Результат = Модуль.ОкрВверх(1.123, 2);
	Ожидаем.Что(Результат).Равно(1.13);


КонецПроцедуры

Процедура ОкрВверх_ОтрицательнаяРазрядность() Экспорт

	Результат = Модуль.ОкрВверх(123, -1);
	Ожидаем.Что(Результат).Равно(130);

КонецПроцедуры

#КонецОбласти // ОкрВверх

