#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	Контекст = Новый Структура("ФабрикаXDTO"); // Чтобы не ругалось
	Модуль = ЗагрузитьСценарий(
		"..\Общие\ОбщиеМодули\РегулярныеВыраженияКлиентСервер.bsl", 
		Контекст
	);

	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ПроверитьСтрокуРегулярнымВыражением_ПростаяПроверка");
	ВсеТесты.Добавить("ПроверитьСтрокуРегулярнымВыражением_ПовторноеИспользованиеКомпоненты");

	ВсеТесты.Добавить("ЗаменитьСовпаденияВнешнейКомпонентой_ПростаяЗамена");
	
	Возврат ВсеТесты;

КонецФункции

#Область ПроверитьСтрокуРегулярнымВыражением

Процедура ПроверитьСтрокуРегулярнымВыражением_ПростаяПроверка() Экспорт

	Строка = "123";
	Шаблон = "\d{3}";
	Результат = Модуль.ПроверитьСтрокуВнешнейКомпонентой(Строка, Шаблон);
	Ожидаем.Что(Результат).Равно(Истина);
	
КонецПроцедуры

Процедура ПроверитьСтрокуРегулярнымВыражением_ПовторноеИспользованиеКомпоненты() Экспорт

	Строка = "123";
	Шаблон = "\d{3}";
	ВнешняяКомпонентаПовтИсп = Неопределено;
	Результат = Модуль.ПроверитьСтрокуВнешнейКомпонентой(Строка, Шаблон, ВнешняяКомпонентаПовтИсп);
	Результат = Модуль.ПроверитьСтрокуВнешнейКомпонентой(Строка, Шаблон, ВнешняяКомпонентаПовтИсп);
	Ожидаем.Что(ВнешняяКомпонентаПовтИсп).ИмеетТип("COMОбъект");
	
КонецПроцедуры

#КонецОбласти // ПроверитьСтрокуРегулярнымВыражением

#Область ЗаменитьСовпаденияВнешнейКомпонентой

Процедура ЗаменитьСовпаденияВнешнейКомпонентой_ПростаяЗамена() Экспорт

	Строка = "123 абв 789";
	Шаблон = "абв";
	Замена = "456";
	Результат = Модуль.ЗаменитьСовпаденияВнешнейКомпонентой(Строка, Шаблон, Замена);
	Ожидаем.Что(Результат).Равно("123 456 789");
	
КонецПроцедуры

#КонецОбласти // ЗаменитьСовпаденияВнешнейКомпонентой

