#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	Контекст = Новый Структура;
	Модуль = ЗагрузитьСценарий(
		"..\Общие\ОбщиеМодули\ОбщегоНазначения\СлучайныеЗначения.bsl", 
		Контекст
	);

	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ЗаполнитьТаблицуЗначенийСлучайнымиЗначениями_Выполнение");
	
	Возврат ВсеТесты;

КонецФункции

#Область ЗаполнитьТаблицуЗначенийСлучайнымиЗначениями

Процедура ЗаполнитьТаблицуЗначенийСлучайнымиЗначениями_Выполнение() Экспорт

	ЗаполняемаяТаблица = Новый ТаблицаЗначений;
	ЗаполняемаяТаблица.Колонки.Добавить("Числовая",						 новый ОписаниеТипов("Число"));
	ЗаполняемаяТаблица.Колонки.Добавить("ЧисловаяФиксНеотриц",			 новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ЗаполняемаяТаблица.Колонки.Добавить("ЧисловаяФиксНеотрицПереопред",	 новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ЗаполняемаяТаблица.Колонки.Добавить("Булевая",						 новый ОписаниеТипов("Булево"));
	ЗаполняемаяТаблица.Колонки.Добавить("УИД",							 новый ОписаниеТипов("УникальныйИдентификатор"));
	ЗаполняемаяТаблица.Колонки.Добавить("СтроковаяНеогр",				 новый ОписаниеТипов("Строка"));
	ЗаполняемаяТаблица.Колонки.Добавить("Строковая64Перем",				 новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(64, ДопустимаяДлина.Переменная)));
	ЗаполняемаяТаблица.Колонки.Добавить("Строковая32Фикс",				 новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(32, ДопустимаяДлина.Фиксированная)));
	ЗаполняемаяТаблица.Колонки.Добавить("Датированная",					 новый ОписаниеТипов("Дата"));
	ЗаполняемаяТаблица.Колонки.Добавить("ДатированнаяТолькоВремя",		 новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	
	ЗаполняемаяТаблица.Колонки.Добавить("ДатаЧислоСтрока", Новый ОписаниеТипов("Строка, Дата, Число",
														   Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Любой),
														   Новый КвалификаторыСтроки(6, ДопустимаяДлина.Переменная),
														   Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));

	КоличествоСтрокТаблицы = 128;
	Для НомерСтроки = 1 По КоличествоСтрокТаблицы Цикл ЗаполняемаяТаблица.Добавить() КонецЦикла;
	
	ПереопределениеТиповКолонок = Новый Соответствие;
	ПереопределениеТиповКолонок.Вставить("ЧисловаяФиксНеотрицПереопред", новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 1, ДопустимыйЗнак.Неотрицательный)));
	
	МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Модуль.ЗаполнитьТаблицуЗначенийСлучайнымиЗначениями(ЗаполняемаяТаблица, , ПереопределениеТиповКолонок, Истина);
	
	ВремяЗаполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - МеткаВремени;	
	
КонецПроцедуры

#КонецОбласти // ЗаполнитьТаблицуЗначенийСлучайнымиЗначениями

