#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("РасположениеИтоговКомпоновкиДанных"); 
	Модуль = ЗагрузитьСценарий(
		"..\Общие\ОбщиеМодули\ОбщегоНазначения\ТаблицаЗначений.bsl", 
		Контекст
	);

	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ИзменитьТипКолонкиТаблицыЗначений_Добавление");
	ВсеТесты.Добавить("ИзменитьТипКолонкиТаблицыЗначений_ДобавлениеУдаление");
	ВсеТесты.Добавить("ИзменитьТипКолонкиТаблицыЗначений_ДобавлениеУдалениеСписком");
	
	Возврат ВсеТесты;

КонецФункции

Процедура ВыполнитьОтдельныйТест(Тест)
	УстановитьТекущийКаталог(ТекущийСценарий().Каталог);
	СписокТестов = ПолучитьСписокТестов(ЮнитТестирование);
	ИмяПроцедурыТеста = СписокТестов[Тест - 1];
	Рефлектор = Новый Рефлектор;
	ТабМетодов = Рефлектор.ПолучитьТаблицуМетодов(ТекущийСценарий());
	Рефлектор.ВызватьМетод(ТекущийСценарий(), ИмяПроцедурыТеста);
КонецПроцедуры

#Область ИзменитьТипКолонкиТаблицыЗначений

Процедура ИзменитьТипКолонкиТаблицыЗначений_Добавление() Экспорт
	
	ТаблицаЗначений = ИзменитьТипКолонкиТаблицыЗначений_ТестоваяТаблица();
	
	// Просто добавим тип Строка
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    "Идентификатор",
		"Строка");

КонецПроцедуры

Процедура ИзменитьТипКолонкиТаблицыЗначений_ДобавлениеУдаление() Экспорт
	
	ТаблицаЗначений = ИзменитьТипКолонкиТаблицыЗначений_ТестоваяТаблица();
	
	// Добавим булево, Уберем дату
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    ТаблицаЗначений.Колонки[1],
		"Булево",
		"Дата");

КонецПроцедуры

Процедура ИзменитьТипКолонкиТаблицыЗначений_ДобавлениеУдалениеСписком() Экспорт
	
	ТаблицаЗначений = ИзменитьТипКолонкиТаблицыЗначений_ТестоваяТаблица();
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(36);
	// Добавим строку, уберем дату и уникальный идентификатор.
	// Ожидаем что преобразуются значения.
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    1,
		"Строка",
		"УникальныйИдентификатор, Дата",,
		КвалификаторСтроки);

КонецПроцедуры


Функция ИзменитьТипКолонкиТаблицыЗначений_ТестоваяТаблица()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Число",			 Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("Идентификатор",	 Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаЗначений.Колонки.Добавить("Дата",			 Новый ОписаниеТипов("Дата"));
	
	#Область Заполнение
	
	Генератор = Новый ГенераторСлучайныхЧисел();
	
	СтрокТаблицы = 999;
	МаксЧисло = pow(2, 24);
	СекундВГоду = КонецГода(ТекущаяДата()) - НачалоГода(ТекущаяДата());
	НачалоГода = НачалоГода(ТекущаяДата());
	
	Для НомерСтроки = 1 По СтрокТаблицы Цикл
		
		СтрокаТаблицы = ТаблицаЗначений.Добавить();
		СтрокаТаблицы.Число			 = Генератор.СлучайноеЧисло(0, МаксЧисло);
		СтрокаТаблицы.Идентификатор	 = Новый УникальныйИдентификатор();
		СтрокаТаблицы.Дата			 = НачалоГода + Генератор.СлучайноеЧисло(0, СекундВГоду);
	
	КонецЦикла; 	
	
	#КонецОбласти // Заполнение 
	
	ТаблицаЗначений.Индексы.Добавить("Число");
	ТаблицаЗначений.Индексы.Добавить("Число, Идентификатор");
	ТаблицаЗначений.Индексы.Добавить("Идентификатор, Дата");
	ТаблицаЗначений.Индексы.Добавить("Число, Дата");
	ТаблицаЗначений.Индексы.Добавить("Дата");

	Возврат ТаблицаЗначений;

КонецФункции

#КонецОбласти // ИзменитьТипКолонкиТаблицыЗначений

//Файл = Новый Файл("..");
//Сообщить(Файл.ПолноеИмя);
//ВыполнитьОтдельныйТест(1);