#Использовать asserts

Перем ЮнитТестирование;
Перем Данные;
Перем Модуль;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	Контекст = Новый Структура;
	Модуль = ЗагрузитьСценарий(
		"..\Общие\ОбщиеМодули\ОбщегоНазначения\ТаблицаЗначений.bsl", 
		Контекст
	);

	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ИзменитьТипКолонкиТаблицыЗначений_Автотест");
	
	Возврат ВсеТесты;

КонецФункции

#Область ИзменитьТипКолонкиТаблицыЗначений

Процедура ИзменитьТипКолонкиТаблицыЗначений_Автотест() Экспорт

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Число",			 Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("Идентификатор",	 Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаЗначений.Колонки.Добавить("Дата",			 Новый ОписаниеТипов("Дата"));
	
	#Область Заполнение
	
	Генератор = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	СтрокТаблицы = 9999;
	МаксЧисло = pow(2, 24);
	СекундВГоду = КонецГода(ТекущаяДатаСеанса()) - НачалоГода(ТекущаяДатаСеанса());
	НачалоГода = НачалоГода(ТекущаяДатаСеанса());
	
	Для НомерСтроки = 1 По СтрокТаблицы Цикл
		
		СтрокаТаблицы = ТаблицаЗначений.Добавить();
		СтрокаТаблицы.Число			 = Генератор.СлучайноеЧисло(0, МаксЧисло);
		СтрокаТаблицы.Идентификатор	 = Новый УникальныйИдентификатор();
		СтрокаТаблицы.Дата			 = НачалоГода + Генератор.СлучайноеЧисло(0, СекундВГоду);
	
	КонецЦикла; 	
	
	#КонецОбласти // Заполнение 
	
	ТаблицаЗначений.Индексы.Добавить("Число");
	ТаблицаЗначений.Индексы.Добавить("Число, Идентификатор");
	ТаблицаЗначений.Индексы.Добавить("Идентификатор, Дата");
	ТаблицаЗначений.Индексы.Добавить("Число, Дата");
	ТаблицаЗначений.Индексы.Добавить("Дата");
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(36);
	
	// Просто добавим тип Строка
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    "Идентификатор",
		"Строка");
		
	// Добавим булево, Уберем строку
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    ТаблицаЗначений.Колонки[1],
		"Булево",
		"Строка");
		
	// Добавим строку, уберем булево и уникальный идентификатор.
	// Ожидаем что преобразуются значения.
	Модуль.ИзменитьТипКолонкиТаблицыЗначений(
		ТаблицаЗначений,
	    1,
		"Строка",
		"УникальныйИдентификатор, Булево",,
		КвалификаторСтроки);
	
КонецПроцедуры

#КонецОбласти // ИзменитьТипКолонкиТаблицыЗначений

