// Формирует массив, состоящий из элементов коллекции.
//
// Параметры:
//  Коллекция - Произвольный - Любая коллекция, поддерживающая обход "Для Каждого ... Из ... Цикл".
//
// Возвращаемое значение:
//   Массив - Элементы коллекции.
//
Функция МассивИзКоллекции(Коллекция) Экспорт
	
	МассивЭлементов = Новый Массив;
	Для Каждого ТекущийЭлемент Из Коллекция Цикл
		МассивЭлементов.Добавить(ТекущийЭлемент);
	КонецЦикла;

	Возврат МассивЭлементов;

КонецФункции // МассивИзКоллекции

#Область HTML

// Формирует документ HTML по строке.
//
// Параметры:
//	Строка - Строка - Исходный текст с разметкой HTML.
//
// Возвращаемое значение:
//	ДокументHTML - Результирующий документ.
//
Функция ДокументHTMLИзСтроки(Строка)

	Чтение = Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(Строка);
	Построитель = Новый ПостроительDOM;
	ДокументHTML = Построитель.Прочитать(Чтение);
	Чтение.Закрыть();

	Возврат ДокументHTML;
	
КонецФункции // ДокументHTMLИзСтроки()

// Извлекает текст из документа HTML
//
// Параметры:
//	ДокументHTML - ДокументHTML - Исходный документ
//
// Возвращаемое значение:
//	Строка - Извлеченный текст.
//
Функция СтрокаИзДокументаHTML(ДокументHTML)

	Запись = Новый ЗаписьHTML;
	Запись.УстановитьСтроку();
	Писатель = Новый ЗаписьDOM;
	Писатель.Записать(ДокументHTML, Запись);

	Возврат Запись.Закрыть();

КонецФункции // СтрокаИзДокументаHTML()

#КонецОбласти // HTML