
// Группирует строки табличного документа по значению колонки.
//
// Параметры:
//  ТабличныйДокумент 	 - ТабличныйДокумент - Документ для группировки.
//  НомерКолонки		 - Число - Номер колонки со значением группировки. Тип значения - Произвольный.
//		Строки с одниаковым значением в колонке, идущие подряд, будут сгруппированы.
//		Например, в качестве значения группировки может выступать "уровень" -- число, 
//		обозначающее уровень вложенности строки в таблице.
//	ВысотаЗаголовка		 - Число - Высота шапки таблицы, в строках. Если шапка отсутствует, указывается 0.
//		Строки шапки не попадают в расчет группировок.
//
Процедура СгруппироватьТабличныйДокументПоЗначениямКолонки(ТабличныйДокумент, НомерКолонки, ВысотаЗаголовка = 0)
	
	Если Ложь Тогда 
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	
	НомерПервойСтроки	 = ВысотаЗаголовка + 1;
	НомерПоследнейСтроки = ТабличныйДокумент.ВысотаТаблицы;
	
	СтрокиНачалаГруппировок = Новый Массив;
	ЗначенияГруппировок = Новый Массив;
	ЗначениеТекущейГруппировки = Неопределено;
	Для НомерСтроки = НомерПервойСтроки По НомерПоследнейСтроки Цикл
		
		ЯчейкаГруппировки = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
		Если ЯчейкаГруппировки.СодержитЗначение Тогда
			ЗначениеГруппировки = ЯчейкаГруппировки.Значение;
		Иначе
			ЗначениеГруппировки = ЯчейкаГруппировки.Текст;
		КонецЕсли; 
		
		Если ЗначениеГруппировки <> ЗначениеТекущейГруппировки Тогда 
			
			//Закрываем группировки до текущей:
			ИндексГруппировки = Неопределено;	// Индекс с конца массива
			Для ОбратныйИндекс = -ЗначенияГруппировок.ВГраница() По 0 Цикл
				Индекс = -ОбратныйИндекс;
				Если ЗначенияГруппировок[Индекс] = ЗначениеГруппировки Тогда
					ИндексГруппировки = Индекс;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ИндексГруппировки <> Неопределено Тогда
				Для ОбратныйИндекс = -ЗначенияГруппировок.ВГраница() По -ИндексГруппировки Цикл
					Индекс = -ОбратныйИндекс; 
					НомерСтрокиНачалаГруппировки = СтрокиНачалаГруппировок[Индекс];
					ТабличныйДокумент.Область(НомерСтрокиНачалаГруппировки, , НомерСтроки - 1).Сгруппировать();
					СтрокиНачалаГруппировок.Удалить(Индекс);
					ЗначенияГруппировок.Удалить(Индекс);
				КонецЦикла;			
			КонецЕсли;   
			
			// Стартуем текущую группировку:    
			СтрокиНачалаГруппировок.Добавить(НомерСтроки);		
			ЗначенияГруппировок.Добавить(ЗначениеГруппировки);
			ЗначениеТекущейГруппировки = ЗначениеГруппировки;
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	Пока ЗначениеЗаполнено(СтрокиНачалаГруппировок) Цикл  
		Индекс = СтрокиНачалаГруппировок.ВГраница();
		НомерСтрокиНачалаГруппировки = СтрокиНачалаГруппировок[Индекс];
		ТабличныйДокумент.Область(НомерСтрокиНачалаГруппировки, , НомерПоследнейСтроки).Сгруппировать();
		СтрокиНачалаГруппировок.Удалить(Индекс);
		ЗначенияГруппировок.Удалить(Индекс);
	КонецЦикла;
	
КонецПроцедуры // СгруппироватьТабличныйДокументПоЗначениямКолонки()     
