// Получает полный путь формы того же объекта, что и указанный,
// но в указанными именем.
//
// Параметры:
//	ОпорнаяФорма - УправляемаяФорма	 - Форма, в контексте которой получается имя дочерней формы
//  ИмяСоседнейФормы	 - Строка	 - Имя формы, для которой нужно получить полное имя
// 
// Возвращаемое значение:
//  Строка - Полное имя формы
//
// Пример:
//	ПолноеИмяСоседнейФормы(ЭтаФорма, "ПроизвольнаяФорма") - Может возвратить "ВнешнийОтчет.ТекущийОтчет.ПроизвольнаяФорма"
//
Функция ПолноеИмяСоседнейФормы(Знач ОпорнаяФорма, ИмяСоседнейФормы)

	ПозицияПоследнейТочки = СтрНайти(ОпорнаяФорма.ИмяФормы, ".", НаправлениеПоиска.СКонца);
	ПутьФормыСТочкой = Лев(ОпорнаяФорма.ИмяФормы, ПозицияПоследнейТочки);
    Возврат ПутьФормыСТочкой + ИмяСоседнейФормы;

КонецФункции // ПолноеИмяСоседнейФормы()

