// Получает полное имя формы встроенной или внешней обработки
//
// Параметры:
//	ОпорнаяФорма - УправляемаяФорма	 - Форма, в контексте которой получается имя дочерней формы
//  ИмяФормы	 - Строка			 - Имя формы, для которой нужно получить полное имя
// 
// Возвращаемое значение:
//  Строка - Полное имя формы
//
// Пример:
//	ПолучитьПолноеИмяФормы(ЭтаФорма, "ПроизвольнаяФорма") - Может возвратить "ВнешнийОтчет.ТекущийОтчет.ПроизвольнаяФорма"
//
Функция ПолучитьПолноеИмяФормы(Знач ОпорнаяФорма, ИмяФормы)

    Возврат Лев(ОпорнаяФорма.ИмяФормы, СтрНайти(ОпорнаяФорма.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + ИмяФормы;

КонецФункции
